use ahash::AHashMap;
use once_cell::sync::Lazy;

pub static CONVERT_MAP: Lazy<AHashMap<char, char>> = Lazy::new(|| {
    AHashMap::from([
        ('＂', '"'),
        ('＃', '#'),
        ('＄', '$'),
        ('％', '%'),
        ('＆', '&'),
        ('＇', '\''),
        ('＊', '*'),
        ('＋', '+'),
        ('．', '.'),
        ('／', '/'),
        ('０', '0'),
        ('１', '1'),
        ('２', '2'),
        ('３', '3'),
        ('４', '4'),
        ('５', '5'),
        ('６', '6'),
        ('７', '7'),
        ('８', '8'),
        ('９', '9'),
        ('＜', '<'),
        ('＝', '='),
        ('＞', '>'),
        ('＠', '@'),
        ('Ａ', 'A'),
        ('Ｂ', 'B'),
        ('Ｃ', 'C'),
        ('Ｄ', 'D'),
        ('Ｅ', 'E'),
        ('Ｆ', 'F'),
        ('Ｇ', 'G'),
        ('Ｈ', 'H'),
        ('Ｉ', 'I'),
        ('Ｊ', 'J'),
        ('Ｋ', 'K'),
        ('Ｌ', 'L'),
        ('Ｍ', 'M'),
        ('Ｎ', 'N'),
        ('Ｏ', 'O'),
        ('Ｐ', 'P'),
        ('Ｑ', 'Q'),
        ('Ｒ', 'R'),
        ('Ｓ', 'S'),
        ('Ｔ', 'T'),
        ('Ｕ', 'U'),
        ('Ｖ', 'V'),
        ('Ｗ', 'W'),
        ('Ｘ', 'X'),
        ('Ｙ', 'Y'),
        ('Ｚ', 'Z'),
        ('＼', '\\'),
        ('＾', '^'),
        ('｀', '`'),
        ('ａ', 'a'),
        ('ｂ', 'b'),
        ('ｃ', 'c'),
        ('ｄ', 'd'),
        ('ｅ', 'e'),
        ('ｆ', 'f'),
        ('ｇ', 'g'),
        ('ｈ', 'h'),
        ('ｉ', 'i'),
        ('ｊ', 'j'),
        ('ｋ', 'k'),
        ('ｌ', 'l'),
        ('ｍ', 'm'),
        ('ｎ', 'n'),
        ('ｏ', 'o'),
        ('ｐ', 'p'),
        ('ｑ', 'q'),
        ('ｒ', 'r'),
        ('ｓ', 's'),
        ('ｔ', 't'),
        ('ｕ', 'u'),
        ('ｖ', 'v'),
        ('ｗ', 'w'),
        ('ｘ', 'x'),
        ('ｙ', 'y'),
        ('ｚ', 'z'),
        ('｛', '{'),
        ('｜', '|'),
        ('｝', '}'),
        ('｡', '。'),
        ('｢', '「'),
        ('｣', '」'),
        ('､', '、'),
        ('･', '·'),
        ('•', '·'),
        ('─', '—'),
        ('―', '—'),
        ('∶', '：'),
        ('‧', '·'),
        ('・', '·'),
        ('﹑', '、'),
        ('〜', '～'),
        ('︰', '：'),
    ])
});

#[must_use]
#[inline]
const fn range(c: char, min: char, max: char) -> bool {
    c >= min && c <= max
}

// https://zh.wikipedia.org/wiki/%E4%B8%AD%E6%97%A5%E9%9F%93%E7%B5%B1%E4%B8%80%E8%A1%A8%E6%84%8F%E6%96%87%E5%AD%97
#[must_use]
#[inline]
pub const fn is_cjk(c: char) -> bool {
    c == '\u{3007}'
        || range(c, '\u{3400}', '\u{4DBF}')
        || range(c, '\u{4E00}', '\u{9FFF}')
        || range(c, '\u{FA0E}', '\u{FA0F}')
        || c == '\u{FA11}'
        || range(c, '\u{FA13}', '\u{FA14}')
        || c == '\u{FA1F}'
        || c == '\u{FA21}'
        || range(c, '\u{FA23}', '\u{FA24}')
        || range(c, '\u{FA27}', '\u{FA29}')
        || range(c, '\u{020000}', '\u{02A6DF}')
        || range(c, '\u{02A700}', '\u{02B738}')
        || range(c, '\u{02B740}', '\u{02B81D}')
        || range(c, '\u{02B820}', '\u{02CEA1}')
        || range(c, '\u{02CEB0}', '\u{02EBE0}')
        || range(c, '\u{030000}', '\u{03134A}')
}

// https://zh.wikipedia.org/wiki/%E6%A0%87%E7%82%B9%E7%AC%A6%E5%8F%B7
#[must_use]
#[inline]
pub const fn is_chinese_punctuation(c: char) -> bool {
    c =='。' || c =='？' || c =='！' ||
     c =='，' || c =='、' || c =='；' ||
     c =='：' || c =='“' || c =='”' ||
     c =='『' || c =='』' || c =='‘' ||
     c =='’' || c =='「' || c =='」' ||
     c =='（' || c =='）' || c =='［' ||
     c =='］' || c =='〔' || c =='〕' ||
     c =='【' || c =='】' ||
     // ——
     c =='—' ||
     // ……
     c =='…' || c =='－' || c =='-' ||
     c =='～' || c =='·' || c =='《' ||
     c =='》' || c =='〈' || c =='〉' ||
     // ﹏﹏
     c =='﹏' ||
     // ＿＿
     c =='＿' || c =='.'
}

// https://zh.wikipedia.org/wiki/%E6%A0%87%E7%82%B9%E7%AC%A6%E5%8F%B7
#[must_use]
#[inline]
pub const fn is_english_punctuation(c: char) -> bool {
    c == '.'
        || c == '?'
        || c == '!'
        || c == ','
        || c == ':'
        || c == '…'
        || c == ';'
        || c == '-'
        || c == '–'
        || c == '—'
        || c == '('
        || c == ')'
        || c == '['
        || c == ']'
        || c == '{'
        || c == '}'
        || c == '"'
        || c == '\''
        || c == '/'
}

pub const fn is_punctuation(c: char) -> bool {
    is_chinese_punctuation(c) || is_english_punctuation(c)
}

#[cfg(test)]
mod test {
    use super::*;

    #[test]
    fn test_is_cjk() {
        assert!(is_cjk('你'));
        assert!(is_cjk('〇'));
        assert!(is_cjk('䀹'));
        assert!(is_cjk('鿃'));
        assert!(is_cjk('\u{9FEB}'));
        assert!(is_cjk('﨧'));

        assert!(!is_cjk('a'));
        assert!(!is_cjk('🍌'));
    }
}
